schmmd/solectrac/esp32/src/main.cpp
    // Session energy summary
    auto sess = doc["session"].to<JsonObject>();
    sess["wh_drawn"]   = roundf(g_session_wh_drawn   * 10.0f) / 10.0f;
    sess["wh_charged"] = roundf(g_session_wh_charged * 10.0f) / 10.0f;
    sess["wh_net"]     = roundf((g_session_wh_drawn - g_session_wh_charged) * 10.0f) / 10.0f;
    sess["wh_capacity"] = PACK_CAPACITY_WH;

    // Session-average net power (positive = net discharge, negative = net charge).
    // Uses *active* time (sum of valid dt's), so bus-silent gaps don't dilute it.
    float avg_power_w = NAN;
    float active_hours = g_session_active_ms / 3600000.0f;
    if (active_hours > 0.01f) {                            // ≥ ~36 s of data
        avg_power_w = (g_session_wh_drawn - g_session_wh_charged) / active_hours;
        sess["avg_power_w"] = roundf(avg_power_w * 10.0f) / 10.0f;
        sess["active_s"]    = g_session_active_ms / 1000;
    }

    if (!isnan(g_pack.soc_pct)) {
        float remaining = g_pack.soc_pct * PACK_CAPACITY_WH / 100.0f;
        sess["wh_remaining"] = roundf(remaining * 10.0f) / 10.0f;
        // ETAs use session-average power so they don't jump with instantaneous load
        if (!isnan(avg_power_w)) {
            if (avg_power_w > 50.0f) {
                sess["eta_to_zero_s"] = (uint32_t)(remaining / avg_power_w * 3600.0f);
            } else if (avg_power_w < -50.0f) {
                float headroom = PACK_CAPACITY_WH - remaining;
                if (headroom > 0)
                    sess["eta_to_full_s"] = (uint32_t)(headroom / -avg_power_w * 3600.0f);
            }
        }
    }

    // Per-cell arrays (20 voltages, 7 temperatures; null if not yet received)
    auto cells = cells_obj["voltages"].to<JsonArray>();
    for (int i = 0; i < NUM_CELLS; i++) {
        if (!isnan(g_cell_v[i]))
            cells.add(roundf(g_cell_v[i] * 1000.0f) / 1000.0f);
        else
            cells.add(nullptr);
    }
    auto temps = cells_obj["temp_readings"].to<JsonArray>();
    for (int i = 0; i < NUM_TEMPS; i++) {
        if (!isnan(g_temp_c[i]))
            temps.add((int)g_temp_c[i]);
        else
            temps.add(nullptr);
    }

    // BMS state
    if (g_bms_state.valid) {
        auto st = doc["bms"]["state"].to<JsonObject>();
        st["byte0"]          = g_bms_state.byte0;
        st["byte1"]          = g_bms_state.byte1;
        st["output_enable"]  = g_bms_state.output_enable  ? 1 : 0;
        st["main_contactor"] = g_bms_state.main_contactor ? 1 : 0;
        st["operating"]      = g_bms_state.operating      ? 1 : 0;
        st["standby"]        = g_bms_state.standby        ? 1 : 0;
        st["charging"]       = g_bms_state.charging       ? 1 : 0;
        st["charger_present"]= g_bms_state.charger_present? 1 : 0;
        st["drive_mode"]     = g_bms_state.drive_mode     ? 1 : 0;
        st["awake"]          = g_bms_state.awake          ? 1 : 0;
    }

    // BMS current limits
    if (g_bms_limit.valid) {
        auto lim = doc["bms"]["limit"].to<JsonObject>();
        addFloat(lim, "discharge_a", g_bms_limit.discharge_a, 2);
        addFloat(lim, "charge_a",    g_bms_limit.charge_a,    2);
        lim["mode"]  = g_bms_limit.mode;
        lim["byte5"] = g_bms_limit.byte5;
    }

    // Combined fault codes (BMS + Motor Controller)
    auto faults = doc["faults"].to<JsonObject>();
    auto bms_codes = faults["bms"].to<JsonArray>();
    if (g_bms_faults.any_fault) {
        for (int code = 100; code <= 145; code++) {
            if (g_bms_faults.active_codes_mask & (1ULL << (code - 100)))
                bms_codes.add(code);
        }
    }
    auto mc_codes = faults["mc"].to<JsonArray>();
    if (g_dm1.valid && g_dm1.dtc_spn != 0)
        mc_codes.add(g_dm1.dtc_spn);

    // Motor
    if (g_motor.valid) {
        auto mot = doc["motor"].to<JsonObject>();
        mot["rpm_signed"]    = g_motor.rpm_signed;
        mot["rpm_magnitude"] = g_motor.rpm_magnitude;
        mot["direction"]     = g_motor.direction;
        mot["range_gear"]    = g_motor.range_gear;
        mot["throttle_raw"]  = g_motor.throttle_raw;
        // Ground speed from RPM × range (Turf/Industrial tire calibration,
        // per Operator Manual p34; Agri tires would need different coeffs).
        if (g_motor.range_gear >= 1 && g_motor.range_gear <= 3) {
            static const float KMH_PER_RPM[3] = {
                5.7f / 2800.0f, 8.6f / 2800.0f, 17.0f / 2800.0f
            };
            float kmh = g_motor.rpm_magnitude * KMH_PER_RPM[g_motor.range_gear - 1];
            addFloat(mot, "speed_kmh", kmh, 2);
            addFloat(mot, "speed_mph", kmh * 0.6213712f, 2);
        }
        if (g_motor.controller_temp_c != INT8_MIN)
            mot["controller_temp_c"] = g_motor.controller_temp_c;
        if (g_motor.motor_temp_c != INT8_MIN)
            mot["motor_temp_c"] = g_motor.motor_temp_c;
    }

    // Charger
    if (g_charger.valid) {
        auto chg = doc["charger"].to<JsonObject>();
        chg["status"] = g_charger.status;
        chg["v_raw"]  = g_charger.v_raw;
        chg["i_raw"]  = g_charger.i_raw;
        chg["flags"]  = g_charger.flags;
        chg["output_disabled"] = g_charger.output_disabled ? 1 : 0;
        chg["line_ok"]         = g_charger.line_ok         ? 1 : 0;
        chg["no_line"]         = g_charger.no_line         ? 1 : 0;
        addFloat(chg, "voltage_v", g_charger.voltage_v, 2);
        addFloat(chg, "current_a", g_charger.current_a, 1);
    }

    // BMS→charger command
    if (g_chgr_cmd.valid) {
        auto cmd = doc["chgr_cmd"].to<JsonObject>();
        cmd["enable"] = g_chgr_cmd.enable;
        addFloat(cmd, "voltage_v", g_chgr_cmd.voltage_v, 1);
        addFloat(cmd, "current_a", g_chgr_cmd.current_a, 1);
        if (g_chgr_cmd.v_raw) cmd["v_raw"] = g_chgr_cmd.v_raw;
        if (g_chgr_cmd.i_raw) cmd["i_raw"] = g_chgr_cmd.i_raw;
    }

    // Vehicle controller
    if (g_vc_state != 0xFF)
        doc["vc"]["state"] = g_vc_state;

    // Dashboard
    if (g_dash_alive != 0xFF)
        doc["dash"]["alive"] = g_dash_alive;

    // DM1 (raw FMI/OC/CM and lamp bytes — fault code is also in faults.mc)
    if (g_dm1.valid) {
        auto dm1 = doc["dm1"].to<JsonObject>();
        dm1["lamp_byte0"] = g_dm1.lamp_byte0;
        dm1["lamp_byte1"] = g_dm1.lamp_byte1;
        dm1["dtc_spn"]    = g_dm1.dtc_spn;
        dm1["dtc_fmi"]    = g_dm1.dtc_fmi;
        dm1["dtc_cm"]     = g_dm1.dtc_cm;
        dm1["dtc_oc"]     = g_dm1.dtc_oc;
    }

    String out;
    serializeJsonPretty(doc, out);
    return out;
}

