schmmd/solectrac/esp32/src/main.cpp
// ── HTTP handlers ─────────────────────────────────────────────────────────────

void handleJson() {
    server.send(200, "application/json", buildJson());
}

void handleRoot() {
    // HTML lives in src/dashboard.html; embedded via board_build.embed_txtfiles.
    // Length excludes the trailing null byte that embed_txtfiles appends.
    size_t len = dashboard_html_end - dashboard_html_start - 1;
    server.send_P(200, "text/html", (PGM_P)dashboard_html_start, len);
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'

static char   slcan_buf[32];
static uint8_t slcan_len = 0;
static bool   slcan_open = false;

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open) return;
    char line[32];
    int n = snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                     msg.identifier, msg.data_length_code);
    for (int i = 0; i < msg.data_length_code; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    Serial.write((uint8_t*)line, n);
}

void slcanHandleCommand(const char* cmd) {
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='solectrac.local', port=28600,
//             channel='can0'  (channel name is accepted but ignored).
//
// Single client at a time: a new connection drops the previous one. All work
// is skipped when no client is in rawmode, so the cost when idle is one
// pointer check per CAN frame.

#define SOCKETCAND_PORT 28600

enum SocketcandState {
    SC_DISCONNECTED,
    SC_WAITING_OPEN,
    SC_WAITING_RAWMODE,
    SC_RAWMODE,
};

static WiFiServer socketcand_server(SOCKETCAND_PORT);
static WiFiClient socketcand_client;
static SocketcandState socketcand_state = SC_DISCONNECTED;
static char     socketcand_buf[64];
static uint8_t  socketcand_len = 0;

void socketcandSendFrame(const twai_message_t& msg) {
    if (socketcand_state != SC_RAWMODE) return;
    uint32_t now_ms = millis();
    uint32_t secs   = now_ms / 1000;
    uint32_t usecs  = (now_ms % 1000) * 1000;
    // EFF flag (bit 31) marks the ID as 29-bit extended — python-can expects this.
    uint32_t id_wire = msg.identifier | (msg.extd ? 0x80000000UL : 0);
    char line[80];
    int n = snprintf(line, sizeof(line), "< frame %lX %lu.%06lu ",
                     (unsigned long)id_wire,
                     (unsigned long)secs, (unsigned long)usecs);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 4; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    n += snprintf(line + n, sizeof(line) - n, " >");
    socketcand_client.write((const uint8_t*)line, n);
}

static void socketcandHandleCommand(const char* cmd) {
    if (socketcand_state == SC_WAITING_OPEN && strncmp(cmd, "< open ", 7) == 0) {
        socketcand_client.print("< ok >");
        socketcand_state = SC_WAITING_RAWMODE;
    } else if (socketcand_state == SC_WAITING_RAWMODE && strcmp(cmd, "< rawmode >") == 0) {
        socketcand_client.print("< ok >");
        socketcand_state = SC_RAWMODE;
    }
    // bcmmode/isotpmode/echo/statistics are intentionally unsupported.
}

void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        if (socketcand_client) socketcand_client.stop();
        socketcand_client = new_client;
        socketcand_client.setNoDelay(true);
        socketcand_client.print("< hi >");
        socketcand_state = SC_WAITING_OPEN;
        socketcand_len   = 0;
    }
    if (socketcand_state != SC_DISCONNECTED && !socketcand_client.connected()) {
        socketcand_client.stop();
        socketcand_state = SC_DISCONNECTED;
        socketcand_len   = 0;
    }
    while (socketcand_client && socketcand_client.available()) {
        char c = socketcand_client.read();
        if (c == '<') {
            socketcand_len = 0;
            socketcand_buf[socketcand_len++] = c;
        } else if (socketcand_len > 0 && socketcand_len < sizeof(socketcand_buf) - 1) {
            socketcand_buf[socketcand_len++] = c;
            if (c == '>') {
                socketcand_buf[socketcand_len] = '\0';
                socketcandHandleCommand(socketcand_buf);
                socketcand_len = 0;
            }
        }
    }
}

// ── Setup & loop ──────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);

    ledInit();
    ledWrite(4, 4, 4);   // dim white the moment firmware starts running

    for (int i = 0; i < NUM_CELLS; i++) g_cell_v[i] = NAN;
    for (int i = 0; i < NUM_TEMPS; i++) g_temp_c[i] = NAN;

    // CAN at 250 kbit/s (J1939 standard). Default rx_queue_len is 5, which
    // overflows when server.handleClient() blocks the loop building JSON.
    // 128 gives ~0.5 s of buffer at full bus utilisation.
    twai_general_config_t can_cfg = TWAI_GENERAL_CONFIG_DEFAULT(
        CAN_TX_PIN, CAN_RX_PIN, TWAI_MODE_NORMAL);
    can_cfg.rx_queue_len = 128;
    can_cfg.tx_queue_len = 32;
    twai_timing_config_t  tim_cfg = TWAI_TIMING_CONFIG_250KBITS();
    twai_filter_config_t  flt_cfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    esp_err_t err = twai_driver_install(&can_cfg, &tim_cfg, &flt_cfg);
    if (err == ESP_OK) {
        err = twai_start();
        if (err == ESP_OK) g_can_initialized = true;
    }

    WiFi.begin(WIFI_SSID, WIFI_PASS);
    while (WiFi.status() != WL_CONNECTED) {
        updateLed();
        delay(50);
    }

    MDNS.begin("solectrac");

    server.on("/",     handleRoot);
    server.on("/json", handleJson);
    server.begin();
    MDNS.addService("http", "tcp", 80);

    socketcand_server.begin();
    socketcand_server.setNoDelay(true);
    MDNS.addService("socketcand", "tcp", SOCKETCAND_PORT);
}

void loop() {
    twai_message_t msg;
    while (twai_receive(&msg, 0) == ESP_OK) {
        if (msg.extd) {
            decodeCAN(msg.identifier, msg.data, msg.data_length_code);
            slcanSendFrame(msg);
            socketcandSendFrame(msg);
        }
    }
    slcanPoll();
    socketcandPoll();
    server.handleClient();
    updateLed();
}
